function [l_theta, l_phi] = centerMPV(H, Rk, theta, phi, theta_0, phi_0)
% Функція розрахунку еквівалентних координат центра МПВ

% l_theta - еквівалентна координата в напрямку польоту
% l_phi - еквівалентна координата поперек польоту
% H - Реальна висота КА в надирі з врахуванням кривизни Землі
% Rk - Радіус кривизни Землі у точці надиру
% theta - кут відхилення КА в напрямку польоту
% phi - кут відхилення КА поперек польоту
% theta_0 - кут відхилення КА в напрямку польоту із врахуванням кривизни Землі
% phi_0 - кут відхилення КА поперек польоту із врахуванням кривизни Землі

% Визначаємо кут відхилення КА
alphaKA = anglealpha(theta, phi);

% Визначаємо відповідний йому кут в центрі Землі (кут між точкою надиру і 
% точкою відхилення КА на поверхні Землі)
thetaZ = angleZemli(H, Rk, alphaKA);

% Вістань (найкоротша - по діагоналі) від надиру до точки центра МПВ
l_r = Rk * thetaZ;

% Вираховуємо висоту, яка б відповідала (еквівалентна) відстані від надира до точки
% (враховуючи кривизну) і заданому куті відхилення КА
if (alphaKA ~= 0.0)
    Hekv = l_r / tan(alphaKA);
else
    Hekv = H;
end

% Розраховуємо еквівалентні координати центра МПВ
l_theta = Hekv * tan(theta_0);
l_phi = Hekv * tan(phi_0);

end