function Hpl = heighttoploschin(H, Rk, theta, phi)
%  Функція визначення висоти на площину сканування (на дотичну до Землі)

% H - Реальна висота супутника в надирі
% Rk - радіус кривизни Землі у відповідній точці
% theta - Кут візування в напрямку польоту
% phi - Кут візування поперек польоту

% Визначаємо кут відхилення КА
alphaKA = anglealpha(theta, phi);

% Визначаємо відповідний йому кут в центрі Землі (кут між точкою надиру і 
% точкою відхилення КА на поверхні Землі)
thetaZ = angleZemli(H, Rk, alphaKA);

% Висота до площини сканування

Hpl = (H + Rk * (1 - cos(thetaZ))) * cos(thetaZ + alphaKA) / cos(alphaKA);

end
