function [x, y] = peretintoch(x1, y1, x2, y2, x3, y3, x4, y4)
% Функція розрахунку координат точок перетину двох ліній

% x, y - координати точки перетину двох прямих
% x1, y1, x2, y2 - перша лінія
% x3, y3, x4, y4 - друга лінія

x = ((x1 - x2) * (x3 - x4) * (y4 - y2) + x2 * (x3 - x4) * (y1 - y2) - x4 *...
    (x1 - x2) * (y3 - y4))/((x3 - x4) * (y1 - y2) - (x1 - x2) * (y3 - y4));

y = ((y1 - y2) * (y3 - y4) * (x4 - x2) + y2 * (y3 - y4) * (x1 - x2) - y4 *...
    (y1 - y2) * (x3 - x4))/((y3 - y4) * (x1 - x2) - (y1 - y2) * (x3 - x4));

end
