function Rk = radkrivzem(Rzmin, Rzmax, gama)
% Функція розрахунку відстані від точки на Земній поверхні до її центру
% дана модель описується еліпсом

% Rk - радіус, який описує кривизну Землі у відповідній точці
% Rt - радіус, тобто відстань від точки на поверхні Землі до центра
% Rzmin - мінімальний радіус
% Rzmax - максимальний радіус
% gama - широта (паратель) Землі (-90°...+90°) в радіанах

Rt = radzem(Rzmin, Rzmax, gama);
Rk = ((Rzmin ^2 + Rzmax ^ 2 - Rt ^ 2) ^ (3 / 2)) / abs(Rzmin * Rzmax);

end
